Repository: kitpymes/template-netcore-validations
Catalog: Kitpymes.Core.Validations.Abstractions/Resources.*.resx
Languages: es

# MsgDirectory
source: Directory path not found
es: Ruta de directorio no encontrada

# MsgDirectoryWithFieldName
source: Field {0} not found
es: No se encontró el campo {0}

# MsgDirectoryWithValue
source: Directory path {0} not found
es: Ruta del directorio {0} no encontrada

# MsgDirectoryWithValueAndFieldName
source: Directory path {0} for field {1} not found
es: Ruta de directorio {0} para el campo {1} no encontrada

# MsgEmail
source: Email address has an invalid format
es: La dirección de correo electrónico tiene un formato no válido

# MsgEmailWithFieldName
source: Field {0} has an invalid format
es: El campo {0} tiene un formato no válido

# MsgEmailWithValue
source: Email address {0} has an invalid format
es: La dirección de correo electrónico {0} tiene un formato no válido

# MsgEmailWithValueAndFieldName
source: Email address {0} for field {1} has an invalid format
es: La dirección de correo electrónico {0} del campo {1} tiene un formato no válido.

# MsgEqual
source: Comparator fields do not match
es: Los campos del comparador no coinciden

# MsgEqualFieldName
source: Compared {0} do not match
es: Comparado {0} no coincide

# MsgEqualFieldsName
source: Field {0} does not match field {1}
es: El campo {0} no coincide con el campo {1}

# MsgErrorsTitle
source: One or more validation errors occurred.
es: Se produjeron uno o más errores de validación.

# MsgExtension
source: File path extension not found
es: Extensión de ruta de archivo no encontrada

# MsgExtensionWithFieldName
source: Field {0} not found
es: No se encontró el campo {0}

# MsgExtensionWithValue
source: File path extension {0} not found
es: Extensión de ruta de archivo {0} no encontrada

# MsgExtensionWithValueAndFieldName
source: File path extension {0} for field {1} not found
es: No se encontró la extensión de la ruta del archivo {0} para el campo {1}

# MsgFile
source: File path not found
es: Ruta de archivo no encontrada

# MsgFileWithFieldName
source: Field {0} not found
es: No se encontró el campo {0}

# MsgFileWithValue
source: File path {0} not found
es: Ruta de archivo {0} no encontrada

# MsgFileWithValueAndFieldName
source: File path {0} for field {1} not found
es: No se encontró la ruta de archivo {0} para el campo {1}

# MsgFriendlyUnexpectedError
source: An unexpected error occurred, try the operation again or contact your system administrator
es: Ocurrió un error inesperado, intente la operación nuevamente o comuníquese con el administrador del sistema

# MsgInvalidFormat
source: Field has an invalid format
es: El campo tiene un formato no válido

# MsgInvalidFormatFieldName
source: Field {0} has an invalid format
es: El campo {0} tiene un formato no válido

# MsgMax
source: Field must be less than {0}
es: El campo debe ser menor que {0}

# MsgMaxFieldName
source: Field {0} must be less than {1}
es: El campo {0} debe ser menor que {1}

# MsgMin
source: Field must be more than {0}
es: El campo debe ser superior a {0}

# MsgMinFieldName
source: Field {0} must be more than {1}
es: El campo {0} debe ser mayor que {1}

# MsgName
source: Name has an invalid format
es: El nombre tiene un formato no válido

# MsgNameWithFieldName
source: Field {0} has an invalid format
es: El campo {0} tiene un formato no válido

# MsgNameWithValue
source: Name {0} has an invalid format
es: El nombre {0} tiene un formato no válido

# MsgNameWithValueAndFieldName
source: Name {0} for field {1} has an invalid format
es: El nombre {0} del campo {1} tiene un formato no válido.

# MsgPassword
source: Password must contain a minimum {0} characters
es: La contraseña debe contener un mínimo de {0} caracteres

# MsgPasswordWithFieldName
source: Field {0} must contain a minimum {1} characters
es: El campo {0} debe contener un mínimo de {1} caracteres.

# MsgRange
source: Field must contain between {0} and {1}
es: El campo debe contener entre {0} y {1}

# MsgRangeFieldName
source: Field {0} must contain between {1} and {2}
es: El campo {0} debe contener entre {1} y {2}

# MsgRequired
source: Field is a mandatory
es: El campo es obligatorio

# MsgRequiredFieldName
source: Field {0} is a mandatory
es: El campo {0} es obligatorio

# MsgSubdomain
source: Subdomain has an invalid format
es: El subdominio tiene un formato no válido

# MsgSubdomainWithFieldName
source: Field {0} has an invalid format
es: El campo {0} tiene un formato no válido

# MsgSubdomainWithValue
source: Subdomain {0} has an invalid format
es: El subdominio {0} tiene un formato no válido

# MsgSubdomainWithValueAndFieldName
source: Subdomain {0} for field {1} has an invalid format
es: El subdominio {0} del campo {1} tiene un formato no válido.

# MsgUnauthorizedAccess
source: Unauthorized access
es: Acceso no autorizado
